vipr-portal/com.iwave.ext.windows/samples/enumerate/1-request.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
	xmlns:w="http://schemas.xmlsoap.org/ws/2005/06/management">
	<s:Header>
		<a:To>http://server:80/wsman</a:To>
		<w:ResourceURI s:mustUnderstand="true">
			http://schemas.microsoft.com/wsman/2005/06/wmi/root/mynamespace/myclass
		</w:ResourceURI>
		<a:ReplyTo>
			<a:Address s:mustUnderstand="true">
				http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
			</a:Address>
		</a:ReplyTo>
		<a:Action s:mustUnderstand="true">
			http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate
		</a:Action>
		<w:MaxEnvelopeSize s:mustUnderstand="true">
			51200
		</w:MaxEnvelopeSize>
		<a:MessageID>
			uuid:C61CA1DC-51C0-4353-AE46-3E42ED0DA794
		</a:MessageID>
		<w:OperationTimeout>PT60.000S</w:OperationTimeout>
	</s:Header>
	<s:Body>
		<n:Enumerate />
	</s:Body>
</s:Envelope>